// 2022cppStudy08.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    std::cout << "\n**연습문제**\n\n" << std::endl;
    std::cout << "1. friend 함수가 가지는 특권은 무엇인지 답하세요." << std::endl;
    //friend 선언 시 기존의 접근제어 체계가 무너져 대상 클래스의 모든 멤버에 접근할 수 있다.
    std::cout << "2. A 클래스의 멤버로 B 클래스(포인터나 참조 제외)가 사용됐다면 이 두 클래스는 어떤 관계라 할 수 있나요? " << std::endl;
    //의존적 관계 혹은 상속,friend의 관계
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
